"""
1. Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
 Пример:
- 6782 -> 23
- 0,56 -> 11
"""
# Задача №1
# a = input('Введите число:')
# res = 0
# for i in a:
#     if i.isdecimal():
#         res = int(i) + res
# print(res)
